devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
/*=========================================================================*//**
@file    uart_lld.c

@author  Daniel Zorychta

@brief   This file support USART peripherals for STM32F1/F3/F4/F7/H7.
         * STM32F7 architecture is supported without extra features.
         * STM32H7 architecture is supported without extra features.

@note    Copyright (C) 2020 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"

#include "uart.h"
#include "uart_ioctl.h"

#if defined(ARCH_stm32f1)
#include "stm32f1/stm32f10x.h"
#include "stm32f1/lib/stm32f10x_rcc.h"
#include "stm32f1/dma_ddi.h"
#define RDR                     DR
#define TDR                     DR
#define USART_CLKSOURCE_PCLK1   1
#define USART_CLKSOURCE_PCLK2   2
#define NDTR                    CNDTR
#define _DMA_DDI_get_stream     _DMA_DDI_get_channel
typedef DMA_Channel_TypeDef     DMA_Stream_TypeDef;
#define UART_MEM                ""
#elif defined(ARCH_stm32f3)
#include "stm32f3/stm32f3xx.h"
#include "stm32f3/lib/stm32f3xx_ll_rcc.h"
#include "stm32f3/dma_ddi.h"
#define SR                      ISR
#define USART_SR_RXNE           USART_ISR_RXNE
#define USART_SR_ORE            USART_ISR_ORE
#define USART_SR_TC             USART_ISR_TC
#define USART_SR_IDLE           USART_ISR_IDLE
#define USART_SR_TXE            USART_ISR_TXE
#define NDTR                    CNDTR
#define _DMA_DDI_get_stream     _DMA_DDI_get_channel
typedef DMA_Channel_TypeDef     DMA_Stream_TypeDef;
#define UART_MEM                ""
#elif defined(ARCH_stm32f4)
#include "stm32f4/stm32f4xx.h"
#include "stm32f4/lib/stm32f4xx_rcc.h"
#include "stm32f4/dma_ddi.h"
#define RDR                     DR
#define TDR                     DR
#define USART_CLKSOURCE_PCLK1   1
#define USART_CLKSOURCE_PCLK2   2
#define UART_MEM                ""
#elif defined(ARCH_stm32f7)
#include "stm32f7/stm32f7xx.h"
#include "stm32f7/lib/stm32f7xx_ll_rcc.h"
#include "stm32f7/dma_ddi.h"
#define SR                      ISR
#define USART_SR_RXNE           USART_ISR_RXNE
#define USART_SR_ORE            USART_ISR_ORE
#define USART_SR_TC             USART_ISR_TC
#define USART_SR_IDLE           USART_ISR_IDLE
#define USART_SR_TXE            USART_ISR_TXE
#define UART_MEM                ""
#elif defined(ARCH_stm32h7)
#include "stm32h7/stm32h7xx.h"
#include "stm32h7/lib/stm32h7xx_ll_rcc.h"
#include "stm32h7/dma_ddi.h"
#define SR                      ISR
#define USART_SR_RXNE           USART_ISR_RXNE_RXFNE
#define USART_SR_ORE            USART_ISR_ORE
#define USART_SR_TC             USART_ISR_TC
#define USART_SR_IDLE           USART_ISR_IDLE
#define USART_SR_TXE            USART_ISR_TXE_TXFNF
#define UART_MEM                "SRAM1"
#endif

/*==============================================================================
  Local symbolic constants/macros
==============================================================================*/
#define DMA_BUFFER_MASK         (_CPUCTL_CACHE_ALIGN - 1)
#define DMA_ALIGN_UP(n)         (((n) + DMA_BUFFER_MASK) & ~DMA_BUFFER_MASK)
#define DMA_ALIGN_DOWN(n)       ((n) & ~DMA_BUFFER_MASK)

#define USE_DMA __UART_UART1_DMA_MODE__ || __UART_UART2_DMA_MODE__\
             || __UART_UART3_DMA_MODE__ || __UART_UART4_DMA_MODE__\
             || __UART_UART5_DMA_MODE__ || __UART_UART6_DMA_MODE__\
             || __UART_UART7_DMA_MODE__ || __UART_UART8_DMA_MODE__\
             || __UART_UART9_DMA_MODE__ || __UART_UART10_DMA_MODE__

/*==============================================================================
  Local types, enums definitions
==============================================================================*/
/* UART registers */
typedef struct {
        USART_TypeDef  *UART;
        __IO uint32_t  *APBENR;
        __IO uint32_t  *APBRSTR;
        const uint32_t  APBENR_UARTEN;
        const uint32_t  APBRSTR_UARTRST;
        const IRQn_Type IRQn;
        const u32_t     IRQ_priority;
        const u32_t     CLKSRC;
        const bool      use_DMA;
        const u16_t     DMA_buf_len;
        const u8_t      DMA_channel;
        const u8_t      DMA_major;
        const u8_t      DMA_rx_stream_pri;
        const u8_t      DMA_rx_stream_alt;
} UART_setup_t;

/* UART DMA buffer */
typedef struct {
        u16_t               rd_idx;
        u32_t               desc;
        DMA_Stream_TypeDef *stream;
        u8_t               *buf;
        u16_t               buflen;
        u8_t                buf_holder[];
} uart_dma_t;

/* UART specific handle */
typedef struct {
        uart_dma_t *DMA;
} uarthdl_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
#if USE_DMA
static bool dma_half_and_finish(DMA_Stream_TypeDef *stream, u8_t sr, void *arg);
#endif

/*==============================================================================
  Local object definitions
==============================================================================*/
MODULE_NAME(UART);

