devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
// all registers which are need to control particular UART peripheral
static const UART_setup_t UART[] = {
        #if defined(RCC_APB2ENR_USART1EN)
        {
                .UART            = USART1,
                .IRQn            = USART1_IRQn,
                .IRQ_priority    = __UART_UART1_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART1_DMA_MODE__,
                .DMA_buf_len     = __UART_UART1_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART1EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART1RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART1EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART1RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK2,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 5,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_USART1_CLKSOURCE,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = 5,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK2,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA2,
                .DMA_rx_stream_pri = 2,
                .DMA_rx_stream_alt = 5,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_USART1_CLKSOURCE,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA2,
                .DMA_rx_stream_pri = 2,
                .DMA_rx_stream_alt = 5,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART16_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 41,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_USART2EN) || defined(RCC_APB1LENR_USART2EN)
        {
                .UART            = USART2,
                .IRQn            = USART2_IRQn,
                .IRQ_priority    = __UART_UART2_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART2_DMA_MODE__,
                .DMA_buf_len     = __UART_UART2_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_USART2EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_USART2RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_USART2EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_USART2RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 6,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_USART2_CLKSOURCE,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = 6,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 5,
                .DMA_rx_stream_alt = 5,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_USART2_CLKSOURCE,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 5,
                .DMA_rx_stream_alt = 5,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART234578_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 43,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_USART3EN) || defined(RCC_APB1LENR_USART3EN)
        {
                .UART            = USART3,
                .IRQn            = USART3_IRQn,
                .IRQ_priority    = __UART_UART3_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART3_DMA_MODE__,
                .DMA_buf_len     = __UART_UART3_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_USART3EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_USART3RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_USART3EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_USART3RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 3,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_USART3_CLKSOURCE,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = 3,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 1,
                .DMA_rx_stream_alt = 1,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_USART3_CLKSOURCE,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 1,
                .DMA_rx_stream_alt = 1,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART234578_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 45,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART4EN) || defined(RCC_APB1LENR_UART4EN)
        {
                .UART            = UART4,
                .IRQn            = UART4_IRQn,
                .IRQ_priority    = __UART_UART4_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART4_DMA_MODE__,
                .DMA_buf_len     = __UART_UART4_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART4EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART4RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART4EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART4RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = _DMA_DDI_DMA2,
                .DMA_rx_stream_pri = 3,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_UART4_CLKSOURCE,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 1,
                .DMA_rx_stream_pri = 3,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 2,
                .DMA_rx_stream_alt = 2,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_UART4_CLKSOURCE,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 2,
                .DMA_rx_stream_alt = 2,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART234578_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 63,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART5EN) || defined(RCC_APB1LENR_UART5EN)
        {
                .UART            = UART5,
                .IRQn            = UART5_IRQn,
                .IRQ_priority    = __UART_UART5_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART5_DMA_MODE__,
                .DMA_buf_len     = __UART_UART5_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART5EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART5RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART5EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART5RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = _DMA_DDI_DMA2,
                .DMA_rx_stream_pri = 4,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_UART5_CLKSOURCE,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 1,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 0,
                .DMA_rx_stream_alt = 0,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_UART5_CLKSOURCE,
                .DMA_channel       = 4,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 0,
                .DMA_rx_stream_alt = 0,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART234578_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 65,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_USART6EN)
        {
                .UART            = USART6,
                .IRQn            = USART6_IRQn,
                .IRQ_priority    = __UART_UART6_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART6_DMA_MODE__,
                .DMA_buf_len     = __UART_UART6_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART6EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART6RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_USART6EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_USART6RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK2,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_USART6_CLKSOURCE,
                #elif defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK2,
                .DMA_channel       = 5,
                .DMA_major         = _DMA_DDI_DMA2,
                .DMA_rx_stream_pri = 1,
                .DMA_rx_stream_alt = 2,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_USART6_CLKSOURCE,
                .DMA_channel       = 5,
                .DMA_major         = _DMA_DDI_DMA2,
                .DMA_rx_stream_pri = 1,
                .DMA_rx_stream_alt = 2,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART16_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 71,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART7EN) || defined(RCC_APB1LENR_UART7EN)
        {
                .UART            = UART7,
                .IRQn            = UART7_IRQn,
                .IRQ_priority    = __UART_UART7_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART7_DMA_MODE__,
                .DMA_buf_len     = __UART_UART7_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART7EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART7RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART7EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART7RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART7_CLKSOURCE,
                #elif defined(ARCH_stm32f4)
                .CLKSRC          = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = 5,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 3,
                .DMA_rx_stream_alt = 3,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_UART7_CLKSOURCE,
                .DMA_channel       = 5,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 3,
                .DMA_rx_stream_alt = 3,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART234578_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 79,
                #endif
        },
        #endif
        #if defined(RCC_APB1ENR_UART8EN) || defined(RCC_APB1LENR_UART8EN)
        {
                .UART            = UART8,
                .IRQn            = UART8_IRQn,
                .IRQ_priority    = __UART_UART8_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART8_DMA_MODE__,
                .DMA_buf_len     = __UART_UART8_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB1LENR,
                .APBRSTR         = &RCC->APB1LRSTR,
                .APBENR_UARTEN   = RCC_APB1LENR_UART8EN,
                .APBRSTR_UARTRST = RCC_APB1LRSTR_UART8RST,
                #else
                .APBENR          = &RCC->APB1ENR,
                .APBRSTR         = &RCC->APB1RSTR,
                .APBENR_UARTEN   = RCC_APB1ENR_UART8EN,
                .APBRSTR_UARTRST = RCC_APB1RSTR_UART8RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC          = LL_RCC_UART8_CLKSOURCE,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = 5,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 6,
                .DMA_rx_stream_alt = 6,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_UART8_CLKSOURCE,
                .DMA_channel       = 5,
                .DMA_major         = _DMA_DDI_DMA1,
                .DMA_rx_stream_pri = 6,
                .DMA_rx_stream_alt = 6,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART234578_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = 81,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_UART9EN)
        {
                .UART            = UART9,
                .IRQn            = UART9_IRQn,
                .IRQ_priority    = __UART_UART9_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART9_DMA_MODE__,
                .DMA_buf_len     = __UART_UART9_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART9EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART9RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART9EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART9RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART9_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_UART9_CLKSOURCE,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_UART9_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART16910_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = UINT8_MAX,
                #endif
        },
        #endif
        #if defined(RCC_APB2ENR_UART10EN) || defined(RCC_APB2ENR_USART10EN)
        {
                .UART            = UART10,
                .IRQn            = UART10_IRQn,
                .IRQ_priority    = __UART_UART10_IRQ_PRIORITY__,
                .use_DMA         = __UART_UART10_DMA_MODE__,
                .DMA_buf_len     = __UART_UART10_DMA_BUF_LEN__,
                #if defined(ARCH_stm32h7)
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART10EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART10RST,
                #else
                .APBENR          = &RCC->APB2ENR,
                .APBRSTR         = &RCC->APB2RSTR,
                .APBENR_UARTEN   = RCC_APB2ENR_UART10EN,
                .APBRSTR_UARTRST = RCC_APB2RSTR_UART10RST,
                #endif
                #if defined(ARCH_stm32f1)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f3)
                .CLKSRC            = LL_RCC_UART10_CLKSOURCE,
                #elif defined(ARCH_stm32f4)
                .CLKSRC            = USART_CLKSOURCE_PCLK1,
                .DMA_channel       = UINT8_MAX,
                .DMA_major         = 0,
                .DMA_rx_stream_pri = UINT8_MAX,
                .DMA_rx_stream_alt = UINT8_MAX,
                #elif defined(ARCH_stm32f7)
                .CLKSRC            = LL_RCC_UART10_CLKSOURCE,
                #elif defined(ARCH_stm32h7)
                .CLKSRC            = LL_RCC_USART16910_CLKSOURCE,
                .DMA_major         = _DMA_DDI_DMA1 | _DMA_DDI_DMA2,
                .DMA_channel       = UINT8_MAX,
                #endif
        }
        #endif
};

/*==============================================================================
  Function definitions
==============================================================================*/
//==============================================================================
/**
 * @brief Function enable USART clock
 *
 * @param hdl           uart handle
 *
 * @return One of errno value
 */
//==============================================================================
int _UART_LLD__turn_on(struct UART_mem *hdl)
{
        int err = EADDRINUSE;

        const UART_setup_t *SETUP = &UART[hdl->major];

        if (!(*SETUP->APBENR & SETUP->APBENR_UARTEN)) {

                uarthdl_t *uarthdl;
                err = sys_zalloc(sizeof(*uarthdl), cast(void**, &uarthdl));
                if (!err) {

                        #if USE_DMA
                        if (SETUP->use_DMA) {

                                size_t buf_len = DMA_ALIGN_UP(UART[hdl->major].DMA_buf_len);
                                buf_len = max(_CPUCTL_CACHE_ALIGN, buf_len);

                                uart_dma_t *dmabuf;
                                size_t dma_buf_size = sizeof(*dmabuf) + buf_len + _CPUCTL_CACHE_ALIGN;

                                err = sys_zalloc2(dma_buf_size, UART_MEM, _MM_FLAG__DMA_CAPABLE,
                                                  _MM_FLAG__DMA_CAPABLE, cast(void**, &dmabuf));
                                if (!err) {
                                        dmabuf->buflen = buf_len;
                                        dmabuf->buf    = (void*)DMA_ALIGN_UP((u32_t)&dmabuf->buf_holder);

