devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f3) || defined(ARCH_stm32f4) || defined(ARCH_stm32f7)
                                        dmabuf->desc = _DMA_DDI_reserve(SETUP->DMA_major,
                                                                        SETUP->DMA_rx_stream_pri);
                                        if (dmabuf->desc == 0) {
                                                dmabuf->desc = _DMA_DDI_reserve(SETUP->DMA_major,
                                                                                SETUP->DMA_rx_stream_alt);
                                        }
#elif defined(ARCH_stm32h7)
                                        dmabuf->desc = _DMA_DDI_reserve(SETUP->DMA_major);
#endif
                                        if (dmabuf->desc) {
                                                err = _DMA_DDI_get_stream(dmabuf->desc, &dmabuf->stream);
                                        }

                                        if (err or (dmabuf->desc == 0)) {
                                                dev_dbg(hdl, "DMA not accessible, using IRQ mode", 0);
                                                sys_free(cast(void*, &dmabuf));
                                        } else {
                                                uarthdl->DMA = dmabuf;
                                        }

                                } else {
                                        dev_dbg(hdl, "no free memory to enable DMA mode", 0);
                                }

                                err = 0;
                        }
                        #endif
                }

                if (!err) {
                        hdl->uarthdl = uarthdl;

                        SET_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
                        CLEAR_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
                        SET_BIT(*SETUP->APBENR, SETUP->APBENR_UARTEN);

                        NVIC_EnableIRQ(SETUP->IRQn);
                        NVIC_SetPriority(SETUP->IRQn, SETUP->IRQ_priority);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Function disable USART clock
 *
 * @param hdl           uart handle
 *
 * @return One of errno value.
 */
//==============================================================================
int _UART_LLD__turn_off(struct UART_mem *hdl)
{
        uarthdl_t *uarthdl = hdl->uarthdl;
        const UART_setup_t *SETUP =  &UART[hdl->major];

        if (uarthdl->DMA) {
                #if USE_DMA
                _DMA_DDI_release(uarthdl->DMA->desc);
                #endif
                sys_free(cast(void*, &uarthdl->DMA));
        }

        NVIC_DisableIRQ(SETUP->IRQn);
        SET_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
        CLEAR_BIT(*SETUP->APBRSTR, SETUP->APBRSTR_UARTRST);
        CLEAR_BIT(*SETUP->APBENR, SETUP->APBENR_UARTEN);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Function resume transmission of buffer.
 *
 * @param hdl           uart handle
 */
//==============================================================================
void _UART_LLD__resume_transmit(struct UART_mem *hdl)
{
        const UART_setup_t *SETUP =  &UART[hdl->major];

        if (!(SETUP->UART->CR1 & USART_CR1_TCIE)) {
                sys_critical_section_begin();

                if (hdl->config.basic.mode == UART_MODE__RS485) {
                        _UART_set_DE_pin(hdl, true);
                }

                SET_BIT(SETUP->UART->CR1, USART_CR1_TCIE);

                sys_critical_section_end();
        }
}

//==============================================================================
/**
 * @brief Function configure selected UART.
 *
 * @param hdl           uart handle
 * @param config        configuration structure
 */
//==============================================================================
int _UART_LLD__configure(struct UART_mem *hdl, const struct UART_rich_config *config)
{
        const UART_setup_t *SETUP = &UART[hdl->major];
        u32_t PCLK = 0;

        /* set baud */
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
        LL_RCC_ClocksTypeDef freq;
        LL_RCC_GetSystemClocksFreq(&freq);

        switch (SETUP->CLKSRC) {
        case USART_CLKSOURCE_PCLK1:
                PCLK = freq.PCLK1_Frequency;
                break;

        case USART_CLKSOURCE_PCLK2:
                PCLK = freq.PCLK2_Frequency;
                break;
        default:
                dev_dbg(hdl, "invalid CLKSRC!", 0);
                break;
        }
#elif defined(ARCH_stm32f7) || defined(ARCH_stm32f3)
        switch (SETUP->CLKSRC) {
        #if defined(LL_RCC_USART1_CLKSOURCE)
        case LL_RCC_USART1_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART2_CLKSOURCE)
        case LL_RCC_USART2_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART3_CLKSOURCE)
        case LL_RCC_USART3_CLKSOURCE:
        #endif
        #if defined(LL_RCC_USART6_CLKSOURCE)
        case LL_RCC_USART6_CLKSOURCE:
        #endif
                PCLK = LL_RCC_GetUSARTClockFreq(SETUP->CLKSRC);
                break;
        #if defined(LL_RCC_UART4_CLKSOURCE)
        case LL_RCC_UART4_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART5_CLKSOURCE)
        case LL_RCC_UART5_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART7_CLKSOURCE)
        case LL_RCC_UART7_CLKSOURCE:
        #endif
        #if defined(LL_RCC_UART8_CLKSOURCE)
        case LL_RCC_UART8_CLKSOURCE:
        #endif
                PCLK = LL_RCC_GetUARTClockFreq(SETUP->CLKSRC);
                break;

        default:
                break;
        }
#elif defined(ARCH_stm32h7)
        PCLK = LL_RCC_GetUSARTClockFreq(SETUP->CLKSRC);
#endif

        SETUP->UART->BRR = (PCLK / (config->basic.baud)) + 1;

        /* set 8 bit word length and wake idle line */
        CLEAR_BIT(SETUP->UART->CR1, USART_CR1_M | USART_CR1_WAKE);

        /* set parity */
        switch (config->basic.parity) {
        case UART_PARITY__OFF:
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        case UART_PARITY__EVEN:
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_PS);
                SET_BIT(SETUP->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        case UART_PARITY__ODD:
                SET_BIT(SETUP->UART->CR1, USART_CR1_PS);
                SET_BIT(SETUP->UART->CR1, USART_CR1_PCE | USART_CR1_M);
                break;
        }

        /* transmitter enable */
        if (config->basic.tx_enable) {
                SET_BIT(SETUP->UART->CR1, USART_CR1_TE);
        } else {
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_TE);
        }

