devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
        /* receiver enable */
        if (config->basic.rx_enable) {
                SET_BIT(SETUP->UART->CR1, USART_CR1_RE);
        } else {
                CLEAR_BIT(SETUP->UART->CR1, USART_CR1_RE);
        }

        /* FIFO enable */
        #if defined(USART_CR1_FIFOEN)
        SET_BIT(SETUP->UART->CR1, USART_CR1_FIFOEN);
        #endif

        /* enable LIN if configured */
        if (config->basic.mode == UART_MODE__LIN) {
                SET_BIT(SETUP->UART->CR2, USART_CR2_LINEN);
        } else {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_LINEN);
        }

        /* configure stop bits */
        if (config->basic.stop_bits == UART_STOP_BIT__1) {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_STOP);
        } else {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_STOP);
                SET_BIT(SETUP->UART->CR2, USART_CR2_STOP_1);
        }

        /* clock configuration (synchronous mode) */
        CLEAR_BIT(SETUP->UART->CR2, USART_CR2_CLKEN | USART_CR2_CPOL | USART_CR2_CPHA | USART_CR2_LBCL);

        /* LIN break detection length */
        if (config->LIN_break_bits == UART_LIN_BREAK__10_BITS) {
                CLEAR_BIT(SETUP->UART->CR2, USART_CR2_LBDL);
        } else {
                SET_BIT(SETUP->UART->CR2, USART_CR2_LBDL);
        }

        /* hardware flow control */
        if (config->basic.features & UART_FEATURE__HARDWARE_FLOW_CTRL) {
                SET_BIT(SETUP->UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        } else {
                CLEAR_BIT(SETUP->UART->CR3, USART_CR3_CTSE | USART_CR3_RTSE);
        }

        /* configure single wire mode */
        if (config->basic.features & UART_FEATURE__SINGLE_WIRE) {
                SET_BIT(SETUP->UART->CR3, USART_CR3_HDSEL);
        } else {
                CLEAR_BIT(SETUP->UART->CR3, USART_CR3_HDSEL);
        }

#if USE_DMA
        uarthdl_t *uarthdl = hdl->uarthdl;
        if (uarthdl->DMA) {
                _DMA_DDI_config_t dma_conf = {0};
                dma_conf.IRQ_priority                 = __CPU_DEFAULT_IRQ_PRIORITY__;
                dma_conf.user_ctx                     = hdl;
                dma_conf.cb_finish                    = dma_half_and_finish;
                dma_conf.cb_half                      = dma_half_and_finish;
                dma_conf.cb_next                      = NULL;
                dma_conf.release                      = false;
                dma_conf.data_number                  = uarthdl->DMA->buflen;
                dma_conf.peripheral_address           = cast(u32_t, &UART[hdl->major].UART->RDR);
#if defined(ARCH_stm32f1) || defined(ARCH_stm32f3)
                dma_conf.memory_address               = cast(u32_t, uarthdl->DMA->buf);
#elif defined(ARCH_stm32f4) || defined(ARCH_stm32f7) || defined(ARCH_stm32h7)
                dma_conf.memory_address[0]            = cast(u32_t, uarthdl->DMA->buf);
                dma_conf.memory_address[1]            = 0;
#endif
                dma_conf.priority_level               = _DMA_DDI_PRIORITY_LEVEL_HIGH;
                dma_conf.memory_data_size             = _DMA_DDI_MEMORY_DATA_SIZE_BYTE;
                dma_conf.peripheral_data_size         = _DMA_DDI_PERIPHERAL_DATA_SIZE_BYTE;
                dma_conf.memory_address_increment     = _DMA_DDI_MEMORY_ADDRESS_POINTER_INCREMENTED;
                dma_conf.peripheral_address_increment = _DMA_DDI_PERIPHERAL_ADDRESS_POINTER_IS_FIXED;
                dma_conf.circular_mode                = _DMA_DDI_CIRCULAR_MODE_ENABLED;
                dma_conf.transfer_direction           = _DMA_DDI_TRANSFER_DIRECTION_PERIPHERAL_TO_MEMORY;
#if defined(ARCH_stm32f4) || defined(ARCH_stm32f7) || defined(ARCH_stm32h7)
                dma_conf.memory_burst                 = _DMA_DDI_MEMORY_BURST_SINGLE_TRANSFER;
                dma_conf.peripheral_burst             = _DMA_DDI_PERIPHERAL_BURST_SINGLE_TRANSFER;
                dma_conf.double_buffer_mode           = _DMA_DDI_DOUBLE_BUFFER_MODE_DISABLED;
                dma_conf.flow_controller              = _DMA_DDI_FLOW_CONTROLLER_DMA;
                dma_conf.peripheral_increment_offset  = _DMA_DDI_PERIPHERAL_INCREMENT_OFFSET_ACCORDING_TO_PERIPHERAL_SIZE;
                dma_conf.channel                      = UART[hdl->major].DMA_channel;
                dma_conf.mode                         = _DMA_DDI_MODE_DIRECT;
        #if defined(ARCH_stm32h7)
                dma_conf.bufferable_transfer          = _DMA_DDI_BUFFERABLE_TRANSFER_ENABLED;
        #endif
#endif
                _DMA_DDI_transfer(uarthdl->DMA->desc, &dma_conf);

                SET_BIT(SETUP->UART->CR1, USART_CR1_IDLEIE);
                SET_BIT(SETUP->UART->CR3, USART_CR3_DMAR);
        } else
#endif
        {
                SET_BIT(SETUP->UART->CR1, USART_CR1_RXNEIE);
        }

        /* enable UART */
        SET_BIT(SETUP->UART->CR1, USART_CR1_UE);

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function receive bytes from DMA buffer.
 *
 * @param  hdl          uart handle
 *
 * @return True if task should yield, otherwise false.
 */
//==============================================================================
static bool receive_from_DMA_buffer(struct UART_mem *hdl)
{
#if USE_DMA
        uarthdl_t *uarthdl = hdl->uarthdl;

        bool yield = false;

        _cpuctl_invalidate_dcache_by_addr(uarthdl->DMA->buf, uarthdl->DMA->buflen);

        int wr_idx = uarthdl->DMA->buflen - uarthdl->DMA->stream->NDTR;

        while (wr_idx != uarthdl->DMA->rd_idx) {
                u8_t byte = uarthdl->DMA->buf[uarthdl->DMA->rd_idx];

                if (++uarthdl->DMA->rd_idx >= uarthdl->DMA->buflen) {
                        uarthdl->DMA->rd_idx = 0;
                }

                bool woken = false;
                sys_queue_send_from_ISR(hdl->rx_queue, &byte, &woken);
                yield |= woken;
        }

        return yield;
#else
        UNUSED_ARG1(hdl);
        return false;
#endif
}

//==============================================================================
/**
 * @brief  Function called by DMA peripheral on half and full transfers.
 *
 * @param  stream       DMA stream
 * @param  sr           status register
 * @param  arg          user's argument (uart handle)
 *
 * @return True if task should yield, otherwise false.
 */
//==============================================================================
#if USE_DMA
static bool dma_half_and_finish(DMA_Stream_TypeDef *stream, u8_t sr, void *arg)
{
        UNUSED_ARG3(stream, sr, arg);
        return receive_from_DMA_buffer(arg);
}
#endif

//==============================================================================
/**
 * @brief Interrupt handling
 *
 * @param major         major device number
 */
//==============================================================================
static void IRQ_handle(u8_t major)
{
        bool yield = false;

        const UART_setup_t *DEV = &UART[major];
        struct UART_mem *hdl = _UART_mem[major];

        /* IDLE line interrupt handler */
        if ((DEV->UART->CR1 & USART_CR1_IDLEIE) && (DEV->UART->SR & (USART_SR_IDLE))) {
                #if defined(ARCH_stm32f1) || defined(ARCH_stm32f4)
                volatile u8_t DR = DEV->UART->RDR;
                UNUSED_ARG1(DR);
                #endif

