devdnl/dnx-rtos/src/system/drivers/uart/stm32fx/uart_lld.c
                yield |= receive_from_DMA_buffer(hdl);

                #if defined(ARCH_stm32f3) || defined(ARCH_stm32f7) || defined(ARCH_stm32h7)
                WRITE_REG(DEV->UART->ICR, USART_ICR_IDLECF);
                #endif
        }

        /* receiver interrupt handler */
        while ((DEV->UART->CR1 & USART_CR1_RXNEIE) && (DEV->UART->SR & (USART_SR_RXNE | USART_SR_ORE))) {

                u8_t DR = DEV->UART->RDR;

                bool woken = false;
                sys_queue_send_from_ISR(hdl->rx_queue, &DR, &woken);
                yield |= woken;

                #if defined(ARCH_stm32f3) || defined(ARCH_stm32f7) || defined(ARCH_stm32h7)
                if (DEV->UART->SR & USART_SR_ORE) {
                        WRITE_REG(DEV->UART->ICR, USART_ICR_ORECF);
                }
                #endif
        }

        /* transmitter interrupt handler */
        size_t items = 0;
        if (sys_queue_get_number_of_items_from_ISR(hdl->tx_queue, &items) == 0) {
                if (items > 0) {
                        if (hdl->config.basic.mode == UART_MODE__RS485) {
                                _UART_set_DE_pin(hdl, true);
                        }

                        SET_BIT(DEV->UART->CR1, USART_CR1_TCIE);
                }
        }

        if ((DEV->UART->CR1 & USART_CR1_TCIE) && (DEV->UART->SR & USART_SR_TC)) {

                do {
                        bool woken = false;
                        u8_t byte;
                        if (sys_queue_receive_from_ISR(hdl->tx_queue, &byte, &woken) == 0) {
                                DEV->UART->TDR = byte;

                        } else {
                                CLEAR_BIT(DEV->UART->CR1, USART_CR1_TCIE);

                                if (hdl->config.basic.mode == UART_MODE__RS485) {
                                        _UART_set_DE_pin(hdl, false);
                                }

                                break;
                        }

                        yield |= woken;

                } while (DEV->UART->SR & USART_SR_TXE);
        }

        /* yield thread if data send or received */
        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief USART1 Interrupt
 */
//==============================================================================
#if defined(RCC_APB2ENR_USART1EN)
void USART1_IRQHandler(void)
{
        IRQ_handle(_UART1);
}
#endif

//==============================================================================
/**
 * @brief USART2 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART2EN) || defined(RCC_APB1LENR_USART2EN)
void USART2_IRQHandler(void)
{
        IRQ_handle(_UART2);
}
#endif

//==============================================================================
/**
 * @brief USART3 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_USART3EN) || defined(RCC_APB1LENR_USART3EN)
void USART3_IRQHandler(void)
{
        IRQ_handle(_UART3);
}
#endif

//==============================================================================
/**
 * @brief UART4 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART4EN) || defined(RCC_APB1LENR_UART4EN)
void UART4_IRQHandler(void)
{
        IRQ_handle(_UART4);
}
#endif

//==============================================================================
/**
 * @brief UART5 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART5EN) || defined(RCC_APB1LENR_UART5EN)
void UART5_IRQHandler(void)
{
        IRQ_handle(_UART5);
}
#endif

//==============================================================================
/**
 * @brief UART6 Interrupt
 */
//==============================================================================
#if defined(RCC_APB2ENR_USART6EN)
void USART6_IRQHandler(void)
{
        IRQ_handle(_UART6);
}
#endif

//==============================================================================
/**
 * @brief UART7 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART7EN) || defined(RCC_APB1LENR_UART7EN)
void UART7_IRQHandler(void)
{
        IRQ_handle(_UART7);
}
#endif

//==============================================================================
/**
 * @brief UART8 Interrupt
 */
//==============================================================================
#if defined(RCC_APB1ENR_UART8EN) || defined(RCC_APB1LENR_UART8EN)
void UART8_IRQHandler(void)
{
        IRQ_handle(_UART8);
}
#endif

//==============================================================================
/**
 * @brief UART9 Interrupt
 */
//==============================================================================
#if defined(RCC_APB2ENR_UART9EN)
void UART9_IRQHandler(void)
{
        IRQ_handle(_UART9);
}
#endif

//==============================================================================
/**
 * @brief UART10 Interrupt
 */
//==============================================================================
#if defined(RCC_APB2ENR_UART10EN) || defined(RCC_APB2ENR_USART10EN)
void UART10_IRQHandler(void)
{
        IRQ_handle(_UART10);
}
#endif

/*==============================================================================
  End of file
==============================================================================*/
